import React from "react";

// Общие типы для всех иконок в этом файле
interface IconProps extends React.SVGProps<SVGSVGElement> {
  size?: number;
  color?: string;
}

// 1. Иконка Главной (Home)
export const LogoIcon = ({
  size,
  width = 512,
  height = 244,
  color = "currentColor",
  ...props
}: IconProps) => {
  // Если передан универсальный параметр size, масштабируем пропорционально исходному viewBox (512x244)
  const finalWidth = size ? size : width;
  const finalHeight = size ? size * (244 / 512) : height;

  return (
    <svg
      width={finalWidth}
      height={finalHeight}
      viewBox="0 0 512 244"
      preserveAspectRatio="xMidYMid"
      {...props}
    >
      <g>
        <path
          d="M195.047619,174.857056 L195.047619,48.7619048 L243.809524,48.7619048 L243.809524,209.523635 C243.809524,228.459276 228.459276,243.809524 209.523635,243.809524 C200.48283,243.809524 191.558356,240.323744 185.142683,233.908419 L0,48.7619048 L68.952468,48.7619048 L195.047619,174.857056 Z M512,195.047619 L463.238095,195.047619 L463.238095,83.4284844 L351.618612,195.047619 L463.238095,195.047619 L463.238095,243.809524 L336.761905,243.809524 C298.890971,243.809524 268.190476,213.109029 268.190476,175.238095 L268.190476,48.7619048 L316.952381,48.7619048 L316.952381,160.761731 L428.95151,48.7619048 L316.952381,48.7619048 L316.952381,2.84217094e-14 L443.42683,2.84217094e-14 C481.300898,2.84217094e-14 512,30.7004604 512,68.5714286 L512,195.047619 Z"
          fill={color}
        />
      </g>
    </svg>
  );
};

// Сюда можно просто дописывать новые const MyNewIcon = ...
